app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    if @book.save  #バリデーションチェック
       flash[:notice] = "Book was successfully created."
       redirect_to book_path(@book.id)
    else
      @books = Book.all
---
INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES ('テスト', 'テスト', '2026-06-09 05:04:46.457558', '2026-06-09 05:04:46.457558') RETURNING "id"
SELECT "books".* FROM "books"

  def update
    book = Book.find(params[:id])
    if book.update(book_params)
---
SELECT "books".* FROM "books" WHERE "books"."id" = 11 LIMIT 1
UPDATE "books" SET "title" = 'テスト1', "body" = 'テスト1', "updated_at" = '2026-06-09 05:05:00.650020' WHERE "books"."id" = 17

  def destroy
    book = Book.find(params[:id])
    if book.destroy
---
SELECT "books".* FROM "books" WHERE "books"."id" = 6 LIMIT 1
DELETE FROM "books" WHERE "books"."id" = 6